EDT/ZUP/zup_edt/src/InformationRegisters/СостоянияВакансий/СостоянияВакансий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияВакансий</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияВакансии</types>
    </type>
  </resources>
  <dimensions>
    <name>Вакансия</name>
    <type>
      <types>CatalogRef.Вакансии</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/ZUP/zup_edt/src/InformationRegisters/СостоянияВакансий/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ТекущееСостояниеВакансий(Вакансии) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Вакансии", Вакансии);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияВакансий.Период,
		|	СостоянияВакансий.Вакансия,
		|	СостоянияВакансий.Состояние
		|ИЗ
		|	РегистрСведений.СостоянияВакансий.СрезПоследних(, Вакансия В (&Вакансии)) КАК СостоянияВакансий";
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	Соответствие = Новый Соответствие;
	Для Каждого СтрокаТаблицы Из ТаблицаРезультат Цикл
		Соответствие.Вставить(СтрокаТаблицы.Вакансия, ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицы));
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти

#КонецЕсли
